# Finding Total Population by Year

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('data/CC_Ward_Age_Gender.csv')

In [3]:
df.head()

   YEAR  WARD AGE_RANGE  FEMALES  MALES  OTHER
0  1994     1       0-4     1686   1782    NaN
1  1994     1      5-14     3322   3473    NaN
2  1994     1     15-19     1797   1826    NaN
3  1994     1     20-24     2413   2418    NaN
4  1994     1     25-34     8837   8686    NaN

In [4]:
df.YEAR.unique()

array([1994, 1996, 1999, 2001, 2004, 2006, 2009, 2011, 2014, 2016, 2019])

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1539 entries, 0 to 1538
Data columns (total 6 columns):
YEAR         1539 non-null int64
WARD         1539 non-null int64
AGE_RANGE    1539 non-null object
FEMALES      1539 non-null int64
MALES        1539 non-null int64
OTHER        140 non-null float64
dtypes: float64(1), int64(4), object(1)
memory usage: 72.3+ KB

### Here I am choosing to only keep dates from 2011 to the most recent data.

In [6]:
df_current = df[df['YEAR'] >= 2009 ]

In [7]:
df_current.head()

     YEAR  WARD AGE_RANGE  FEMALES  MALES  OTHER
839  2009     1       0-4     3371   3315    NaN
840  2009     1      5-14     5490   5517    NaN
841  2009     1     15-19     2937   3166    NaN
842  2009     1     20-24     3680   3730    NaN
843  2009     1     25-34     7496   7138    NaN

In [8]:
df_current = df_current.drop(columns = ['WARD', 'AGE_RANGE', 'OTHER'])

In [9]:
df_current.head()

     YEAR  FEMALES  MALES
839  2009     3371   3315
840  2009     5490   5517
841  2009     2937   3166
842  2009     3680   3730
843  2009     7496   7138

In [10]:
df_current['TOTAL'] = df.FEMALES + df.MALES

In [11]:
df_current.head()

     YEAR  FEMALES  MALES  TOTAL
839  2009     3371   3315   6686
840  2009     5490   5517  11007
841  2009     2937   3166   6103
842  2009     3680   3730   7410
843  2009     7496   7138  14634

In [12]:
df_current = df_current.drop(columns = ['FEMALES', 'MALES'])

In [13]:
df_grouped = df_current.groupby('YEAR').sum()

In [14]:
df_grouped.head()

        TOTAL
YEAR
2009  1065455
2011  1090936
2014  1195194
2016  1235171
2019  1280307

### Back to the Original DataFrame to Find 2019 Population by Age

In [15]:
df.head()

   YEAR  WARD AGE_RANGE  FEMALES  MALES  OTHER
0  1994     1       0-4     1686   1782    NaN
1  1994     1      5-14     3322   3473    NaN
2  1994     1     15-19     1797   1826    NaN
3  1994     1     20-24     2413   2418    NaN
4  1994     1     25-34     8837   8686    NaN

In [16]:
df_2019 = df[df['YEAR'] == 2019]

In [17]:
df_2019.head()

      YEAR  WARD AGE_RANGE  FEMALES  MALES  OTHER
1399  2019     1       0-4     2300   2410   16.0
1400  2019     1      5-14     6041   6194   37.0
1401  2019     1     15-19     2557   2787   14.0
1402  2019     1     20-24     2409   2672   20.0
1403  2019     1     25-34     5240   5160   29.0

In [18]:
df_2019['TOTAL'] = df.FEMALES + df.MALES

/Users/jaklynsoler/opt/anaconda3/envs/learn-env/lib/python3.6/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [25]:
df_total = df_2019.drop(columns = ['FEMALES', 'MALES', 'OTHER', 'YEAR'])

In [26]:
df_total.head()

      WARD AGE_RANGE  TOTAL
1399     1       0-4   4710
1400     1      5-14  12235
1401     1     15-19   5344
1402     1     20-24   5081
1403     1     25-34  10400

### Which Wards for Which Districts?

- City Centre: Ward 7, Ward 8
- East: Ward 9
- West: Ward 6
- North: Ward 2, Ward 3, Ward 4
- North East: Ward 5, Ward 10
- North West: Ward 1
- South: Ward 11, Ward 13, Ward 14
- South East: Ward 12

### Sorting the Data by Area

In [27]:
# creating arrays for the areas that have more than 2 wards
cc = [7,8]
north = [2,3,4]
ne = [5,10]
south = [11,13,14]

City Centre

In [43]:
df_city_centre = df_total.loc[df_total['WARD'].isin(cc)]
df_city_centre = df_city_centre.drop(columns = 'WARD')
df_city_centre.groupby('AGE_RANGE').sum()

           TOTAL
AGE_RANGE
0-4         8571
15-19       5287
20-24      13092
25-34      42097
35-44      32038
45-54      19823
5-14       12647
55-64      17208
65-74      11038
75+         7673

East

In [44]:
df_east = df_total[df_total['WARD'] == 9]
df_east = df_east.drop(columns = 'WARD')
df_east.groupby('AGE_RANGE').sum()

           TOTAL
AGE_RANGE
0-4         5567
15-19       4019
20-24       4899
25-34      15569
35-44      15980
45-54      12338
5-14        9719
55-64      12237
65-74       6999
75+         4137

West

In [46]:
df_west = df_total[df_total['WARD'] == 6]
df_west = df_west.drop(columns = 'WARD')
df_west.groupby('AGE_RANGE').sum()

           TOTAL
AGE_RANGE
0-4         5056
15-19       5836
20-24       4717
25-34       9525
35-44      14271
45-54      14405
5-14       13693
55-64      11677
65-74       7130
75+         4641

North

In [47]:
df_north = df_total.loc[df_total['WARD'].isin(north)]
df_north = df_north.drop(columns = 'WARD')
df_north.groupby('AGE_RANGE').sum()

           TOTAL
AGE_RANGE
0-4        15638
15-19      15134
20-24      15786
25-34      36136
35-44      42198
45-54      36305
5-14       34485
55-64      31902
65-74      19573
75+        11547

North East

In [48]:
df_north_east = df_total.loc[df_total['WARD'].isin(ne)]
df_north_east = df_north_east.drop(columns = 'WARD')
df_north_east.groupby('AGE_RANGE').sum()

           TOTAL
AGE_RANGE
0-4        12808
15-19      11271
20-24      12345
25-34      30329
35-44      32730
45-54      22542
5-14       27384
55-64      20055
65-74      12864
75+         5608

Nort West

In [49]:
df_north_west = df_total[df_total['WARD'] == 1]
df_north_west = df_north_west.drop(columns = 'WARD')
df_north_west.groupby('AGE_RANGE').sum()

           TOTAL
AGE_RANGE
0-4         4710
15-19       5344
20-24       5081
25-34      10400
35-44      13700
45-54      13292
5-14       12235
55-64      11391
65-74       7682
75+         5215

South

In [50]:
df_south = df_total.loc[df_total['WARD'].isin(south)]
df_south = df_south.drop(columns = 'WARD')
df_south.groupby('AGE_RANGE').sum()

           TOTAL
AGE_RANGE
0-4        15411
15-19      15416
20-24      15496
25-34      38745
35-44      44274
45-54      39422
5-14       33667
55-64      38970
65-74      25529
75+        15925

South East

In [51]:
df_south_east = df_total[df_total['WARD'] == 12]
df_south_east = df_south_east.drop(columns = 'WARD')
df_south_east.groupby('AGE_RANGE').sum()

           TOTAL
AGE_RANGE
0-4         9563
15-19       5297
20-24       4567
25-34      19240
35-44      22866
45-54      13610
5-14       17739
55-64       9548
65-74       5301
75+         2142